In [1]:
import pandas

data1 = {'name' : ['Jerry','Riah','Paul'],
        'agol' : ['A','A+','B'],
        'basic' : ['C','B','B+'],
        'c++' : ['B+','C','C+']}

data2 = {'c0':[1,2,3],
        'c1':[4,5,6],
        'c2':[7,8,9],
        'c3':[10,11,12],
        'c4':[13,14,15]}

In [10]:
df1 = pandas.DataFrame(data1)
df1.set_index('name',inplace=True)
df1

      agol basic c++
name
Jerry    A     C  B+
Riah    A+     B   C
Paul     B    B+  C+

In [11]:
df2 = pandas.DataFrame(data2)
df2.set_index('c0',inplace=True)
df2

    c1  c2  c3  c4
c0
1    4   7  10  13
2    5   8  11  14
3    6   9  12  15

In [12]:
writer = pandas.ExcelWriter('통합문서.xls')
df1.to_excel(writer, sheet_name = 'Sheet1' )
df2.to_excel(writer, sheet_name = 'Sheet2' )
writer.save()